Numerical_Simulation_Melting_Of_Ice_Using_Openfoam_By_Mr_Vignesh.s.p/Melting_ice/0.orig/fluidZone/fluidZone_alpha1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    arch        "LSB;label=32;scalar=64";
    location    "0/fluidZone";
    object      fluidZone:alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 1;

boundaryField
{
    fluidFrontAndBack
    {
        type            empty;
    }
    fluidZone_to_solidZone
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
