Numerical_Simulation_Melting_Of_Ice_Using_Openfoam_By_Mr_Vignesh.s.p/Melting_ice/0.orig/solidZone/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0/solidZone";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298;

boundaryField
{
    solidWall
    {
        type            fixedValue;
        value           uniform 298;
    }
    solidZone_to_fluidZone
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 258;
        Tnbr            T;
        kappaMethod     fluidThermo;
        kappa           none;
    }
}


// ************************************************************************* //
